{"pageProps":{"urlResolver":{"image":"https://raw.githubusercontent.com/nauchikus/typescript-definitive-guide/master/book/ru/chapters/000.(Общее) Что такое TypeScript и для чего он нужен/images/"},"sectionInfoAll":[{"key":"Что такое TypeScript и для чего он нужен","elementId":"Chto_takoe_TypeScript_i_dlya_chego_on_nujen","markdown":"# Что такое TypeScript и для чего он нужен\nПоскольку постижение всего нового занимает много драгоценного времени и сил, то человек, прежде чем сделать выбор, должен взвесить все \"за\" и \"против\". Чем больше у него сопряженного опыта, тем легче будет принять решение. Это означает, что недавно присоединившимся к _JavaScript_ сообществу людям будет полезнее начать свое погружение в _TypeScript_ с подтверждения правильности своего выбора. Кроме того, данная глава сможет ответить на многие вопросы опытных разработчиков, которые обдумывают использование данного языка при создании очередного проекта. Поэтому обойдемся без затягивания и начнем по порядку разбирать самые часто возникающие вопросы связанные с _TypeScript_."},{"key":"Что такое TypeScript и для чего он нужен_0","elementId":"Opredelenie","markdown":"## Определение\n\n_TypeScript_ — это язык программирования со статической типизацией, позиционирующий себя как язык, расширяющий возможности _JavaScript_.\n  \n_Typescript_ код компилируется в _JavaScript_ код, который можно запускать как на клиентской стороне (браузер), так и на стороне сервера (_nodejs_). Качество сгенерированного кода сопоставимо с кодом, написанным профессиональным разработчиком с большим стажем. Мультиплатформенный компилятор _TypeScript_ отличается высокой скоростью компиляции и публикуется под лицензией _Apache_, а в его создании принимают участие разработчики со всего мира, что привело к традиции выпускать новую версию каждые два месяца. Несмотря на такую периодичность, версии долгое время сохраняют совместимость, а по истечению долгого времени устаревшее поведение остается доступным при активизации специальных флагов компилятора. Поэтому не стоит опасаться, что проект будет лишен новых возможностей языка из-за версионных различий _TypeScript_. Ну а большое количество разработчиков компилятора означает, что с каждой новой версией компилятор получает обновления, касающиеся всех направлений, будь то синтаксические конструкции или оптимизации скорости компиляции и сборки проекта."},{"key":"Что такое TypeScript и для чего он нужен_1","elementId":"Istoriya_TypeScript","markdown":"## История TypeScript\n\nРазработчиком языка _TypeScript_ является _Андерс Хейлсберг_, также известный как создатель языков _Turbo Pascal_, _Delphi_ и _C#_. С того момента, когда компания _MicroSoft*_ анонсировал данный язык в 2012 году, _TypeScript_ не перестает развиваться и склоняет все больше профессиональных разработчиков писать свои программы на нем. На текущий момент трудно представить крупную компанию, не использующую его в своих проектах. Поэтому знание _TypeScript_ будет весомым критерием при устройстве на работу своей мечты."},{"key":"Что такое TypeScript и для чего он нужен_2","elementId":"Dlya_chego_nujen_TypeScript","markdown":"## Для чего нужен TypeScript\n\nПоскольку сложность современных вэб приложений сопоставима с настольными, то прежде всего _TypeScript_ предназначен для выявления ошибок на этапе компиляции, а не на этапе выполнения. Кроме того, за счет системы типов разработчики получают такие возможности, как подсказки и переходы по коду, которые значительно ускоряют процесс разработки. Помимо этого, система типов в значительной степени избавляет разработчиков от комментирования кода, которое отнимает значительное время. Также система типов помогает раньше выявлять проблемы архитектуры, исправление которых обходятся дешевле на ранних этапах.\n\nХотя на текущий момент практически невозможно найти библиотеку, которая бы не была портирована на _TypeScript_. _JavaScript_ код, оставшийся от предыдущих проектов, не стоит списывать со счетов, поскольку его совместное использование не вызовет никакой проблемы. Компилятор _TypeScript_ отлично справляется с динамическим _JavaScript_ кодом, включенным в свою типизированную среду, и даже выявляет в нем ошибки. Кроме того, при компиляции _.ts_ файлов в _.js_ дополнительно генерируются файлы декларации _.d.ts_, с помощью которых разработчики, создающие свои программы исключительно на _JavaScript_, получат все прелести типизированного автодополнения в любой современной среде разработки."},{"key":"Что такое TypeScript и для чего он нужен_3","elementId":"Zachem_razrabotchiku_TypeScript","markdown":"## Зачем разработчику TypeScript\n\n_TypeScript_ значительно сокращает время на устранение ошибок и выявление багов, которые порой не так просто определить в динамической среде _JavaScript_.\n\nВ случае, если для разработчика _TypeScript_ является первым типизированным языком, следует знать, что его изучение значительно ускорит процесс профессионального роста, поскольку типизированный мир открывает аспекты программирования, которые не проявляются в языках с динамической типизацией.\n\nПомимо этого, _TypeScript_ позволяет писать более понятный и читаемый код, максимально описывающий предметную область, за счет чего архитектура приложения становится более выраженной, а разработка неявно увеличивает профессиональный уровень программиста.\n\nВсё это в своей совокупности сокращает время разработки программы, снижая её стоимость и предоставляя разработчикам возможность поскорее приступить к реализации нового и ещё более интересного проекта."}],"githubFileInfo":{"lastUpdate":1619783636000,"contributorAll":[{"name":"hauseyo","avatar":"https://avatars.githubusercontent.com/u/63884278?v=4","bio":"","githubUrl":"https://github.com/hauseyo"}]},"pageNav":{"isPrevPage":true,"isNextPage":true,"prevPage":{"title":"","path":""},"nextPage":{"title":"Вступление","path":"Vstuplenie"}},"contentNavData":{"key":"Что такое TypeScript и для чего он нужен","level":0,"index":0,"contentIndex":0,"section":"Общее","title":"Что такое TypeScript и для чего он нужен","path":"Chto_takoe_TypeScript_i_dlya_chego_on_nujen","elementId":"Chto_takoe_TypeScript_i_dlya_chego_on_nujen","children":[{"key":"Что такое TypeScript и для чего он нужен_0","index":0,"contentIndex":1,"level":1,"section":"Общее","title":"Определение","path":"Opredelenie","elementId":"Opredelenie"},{"key":"Что такое TypeScript и для чего он нужен_1","index":1,"contentIndex":2,"level":1,"section":"Общее","title":"История TypeScript","path":"Istoriya_TypeScript","elementId":"Istoriya_TypeScript"},{"key":"Что такое TypeScript и для чего он нужен_2","index":2,"contentIndex":3,"level":1,"section":"Общее","title":"Для чего нужен TypeScript","path":"Dlya_chego_nujen_TypeScript","elementId":"Dlya_chego_nujen_TypeScript"},{"key":"Что такое TypeScript и для чего он нужен_3","index":3,"contentIndex":4,"level":1,"section":"Общее","title":"Зачем разработчику TypeScript","path":"Zachem_razrabotchiku_TypeScript","elementId":"Zachem_razrabotchiku_TypeScript"}]}},"__N_SSG":true}